BobFredGard/CTRL-ESP32-AMPERO-TONEX/src/main.cpp
void encod2(int valmini, int valmaxi, int pot, byte sel){
  switch (sel) {
    case 0 :
        pot = encoder2.getCount();
        if (pot > valmaxi) {pot = valmaxi;}
        if (pot < valmini) {pot = valmini;}
        midiblabla(toneXquick[0][count2], pot, params[id][56]);
        params[id][toneXquick[1][count2]] = pot;
        encoder2.setCount(pot);
        enc2last = pot;
        Screens(3, params[id][toneXquick[1][count2]]);
    break;
    case 1 :
        pot = encoder2.getCount();
        if (pot > valmaxi) {pot = valmaxi;}
        if (pot < valmini) {pot = valmini;}
        if (count == 55) {
          progChange(tonevalbk, pot, params[id][57]);
          progChang[id+pied][0] = pot;
        }
        if (count == 56) {
          progChange(ampvalbk, pot, params[id][58]);
          progChang[id+pied][1] = pot;
          }
        if (count != 55 or count != 56){
          params[id][count] = pot;
          if (params[id][count] == 139 or params[id][count] == 140){
            if (count > 17 && count < params[id][56]) {
              if (params[id][count] == 139){midiblabla(totalCC[0][count], 0, params[id][56]);}
              else {midiblabla(totalCC[0][count], 127, params[id][56]);}
            }
          }
          if (count > 17 && count < params[id][56]) {
            if (params[id][count] == 129){midiblabla(totalCC[0][count], 0, params[id][56]);}
            if (params[id][count] == 130){midiblabla(totalCC[0][count], 127, params[id][56]);}
            if (params[id][count] < 128){
              midiblabla(totalCC[0][count], params[id][count], params[id][56]);
            }
          }
          if (count > 0 && count < 18) {
            if (params[id][count] == 129){midiblabla(totalCC[0][count], 0, params[id][58]);}
            if (params[id][count] == 130){midiblabla(totalCC[0][count], 127, params[id][58]);}
            if (params[id][count] < 128){
              midiblabla(totalCC[0][count], params[id][count], params[id][58]);
            }
          }
        }        
        encoder2.setCount(pot);
        enc2last = pot;
    break;
  }
}

void commun(){
  Screens(1, params[id][count]);
  static int tmp, encvalMax, encvalMini;
  while (menus == 1) {
    initEncoder(2);
    if (count == 55){initEncoder(4);}
    if (count == 56){initEncoder(5);}
    if (count != 55 && count !=56){initEncoder(6);}
    if (enc1last != encoder1.getCount()) {encod1(1,56,count,1); } 
    if (enc2last != encoder2.getCount()) {
      if (count != 55 && count != 56) {
        if (params[id][count] == 139 or params[id][count] == 140){
          if (params[id][count] == 140) {tmp = 140; encvalMax = 140; encvalMini = 139;}
          else {tmp = 139; encvalMax = 140; encvalMini = 139;}
        }
        if (params[id][count] == 129 or params[id][count] == 130){
          if (params[id][count] == 130) {tmp = 130; encvalMax = 130; encvalMini = 129;}
          else {tmp = 129; encvalMax = 130; encvalMini = 129;}
        }
        if (params[id][count] < 128){
          if (params[id][count] < 128) {tmp = -1; encvalMax = valmaxCC[count]; encvalMini = 0; }
        }
      } 
      else {
        if (progChang[id+pied][0] < 128 && count == 55){tonevalbk = 0;}
        if (progChang[id+pied][1] < 128 && count == 56){ampvalbk =  0;}
        if (progChang[id+pied][0] > 127 && progChang[id+pied][0] < 151 && count == 55){tonevalbk = 1;}
        if (progChang[id+pied][1] > 127 && progChang[id+pied][1] < 257 && count == 56){ampvalbk = 1;}
        if (progChang[id+pied][1] > 255 && progChang[id+pied][1] < 301 && count == 56){ampvalbk = 2;}
        tmp = -1; encvalMax = valmaxCC[count]; encvalMini = 0; 
      }
    encod2(encvalMini,encvalMax,count,1);          
    Screens(1, tmp);
    }
    if (digitalRead(23) == 0) {
      delay(150);
      if (digitalRead(5) == 0) {
        Screens(10, 0);
        saveData(); delay(250);
        count1 = 0; count2 = 0; 
        if(count<18) {startcharg = 2;} else{startcharg = 3;} break;
      }
      count1 = 0; count2 = 0; 
      if(count<18) {startcharg = 2;} else{startcharg = 3;} break;
    }
  }
}

void BoutRot(byte choixrot, byte menu) {
  switch (choixrot) {
    case 1 :
      switch (menu) {
        case 0 :
          if (couleur1 == 1) {//displayColor1(rgbcolor[count1]);
            couleur1 = 2;
          }
          else {
            if (startcharg == 1){count1 = 0; startcharg = 0;}
            if (count1 >= 0 &&  count1 < 6) {
              count1 = count1+1;
            }
            else {count1 = 1;}
            initEncoder(1);
            byte tmp;
            if (params[id][Amperoquick[1][count1]] > 135){
              if (params[id][Amperoquick[1][count1]] == 139) {tmp = 139;}
              else {tmp = 140;}
            }
            if (params[id][Amperoquick[1][count1]] > 128 && params[id][Amperoquick[1][count1]] < 135) {
              if (params[id][Amperoquick[1][count1]] == 130) {tmp = 130;}
              else {tmp = 129;}
            } 
            if (params[id][Amperoquick[1][count1]] < 128) {tmp = -1;}
            if (startscreen != 1) {Screens(2, tmp);} else {startscreen = 0;}
            //displayColor1(rgbcolor[count1]);
          break;
          }
        case 1 : 
          // Screens(1, params[id][count]);
          count = 1;
          commun();
        break;
      }
    break;
    case 2 :
      switch (menu) {
        case 0 : 
          if (couleur2 == 1) {//displayColor2(rgbcolor[count2]); 
          couleur2 = 2;
          }
          else {
            if (startcharg == 1){count2 = 0; startcharg = 0;}
            if (count2 >= 0 &&  count2 < 6) {
              count2 = count2+1;
            }
            else {count2 = 1;}
            initEncoder(1);
            static byte tmp;
            if (params[id][toneXquick[1][count2]] > 135){
              if (params[id][toneXquick[1][count2]] == 139) {tmp = 139;}
              else {tmp = 140;}
            }
            if (params[id][toneXquick[1][count2]] > 128 && params[id][toneXquick[1][count2]] > 135) {
                if (params[id][toneXquick[1][count2]] == 130) {tmp = 130;}
                else {tmp = 129;}
              }
            if (params[id][toneXquick[1][count2]] > 128) {tmp = -1;}
            if (startscreen != 1) {Screens(3, tmp);} else {startscreen = 0;}
           // displayColor1(rgbcolor[count2]);
          }
        break;
        case 1 :
          count = 18;
          commun();
        break;
      }
    break;
  }
}

void choixprogchang(){
  if (progChang[id+pied][0] < 128 or progChang[id+pied][1] < 128){ampvalbk = 0; tonevalbk = 0;}
  if (progChang[id+pied][0] > 127 && progChang[id+pied][0] < 151){tonevalbk = 1;}
  if (progChang[id+pied][1] > 127 && progChang[id+pied][1] < 257){ampvalbk = 1;}
  if (progChang[id+pied][1] > 255 && progChang[id+pied][1] < 301){ampvalbk = 2;}
}

void firstcharg(){
  progChange(tonevalbk, progChang[id+pied][0], params[id][57]);
  progChange(ampvalbk,  progChang[id+pied][1], params[id][58]);
  delay(10);
  for (i = 18; i < params[id][54]; i++){
    MIDI.sendControlChange(totalCC[0][i], params[id][i], params[id][57]);
      /*Serial.print("ToneX -> CC : "); Serial.print(totalCC[0][i]); Serial.print(" - Val : ");
      Serial.print(params[id][i]); Serial.print(" - Channel : "); Serial.println(params[id][57]);*/
  }
  for (i = 1; i < 18; i++){
    MIDI.sendControlChange(totalCC[0][i], params[id][i], params[id][58]);
      /*Serial.print("Ampero -> CC : "); Serial.print(totalCC[0][i]); Serial.print(" - Val : ");
      Serial.print(params[id][i]); Serial.print(" - Channel : "); Serial.println(params[id][58]);*/
  }
}

void chgtPedal() {
  if (progChang[id+pied][0] != progChangcopy[id+pied][0]) {progChange(tonevalbk, progChang[id+pied][0], params[id][57]);}
  if (progChang[id+pied][1] != progChangcopy[id+pied][1]) {progChange(ampvalbk,  progChang[id+pied][1], params[id][58]);}
  delay(10);
  for (i = 18; i < params[id][54]; i++){
    if (params[id][i] != params[preID][i]) {
      MIDI.sendControlChange(totalCC[0][i], params[id][i], params[id][57]);
      /*Serial.print("ToneX -> CC : "); Serial.print(totalCC[0][i]); Serial.print(" - Val : ");
      Serial.print(params[id][i]); Serial.print(" - Channel : "); Serial.println(params[id][57]); */
    }
  }
  for (i = 1; i < 18; i++){
    if (params[id][i] != params[preID][i]) {
      MIDI.sendControlChange(totalCC[0][i], params[id][i], params[id][58]);
      /*Serial.print("Ampero -> CC : "); Serial.print(totalCC[0][i]); Serial.print(" - Val : ");
      Serial.print(params[id][i]); Serial.print(" - Channel : "); Serial.println(params[id][58]);*/
    }
  }
  //mcp.digitalWrite(leds[pied], HIGH);
  //mcp.digitalWrite(leds[preID], LOW);
}

void selectBank() {
  if (id < 43) {bank = 1;}
  if (id > 42 && id < 85) {bank = 2;}
  if (id > 84 && id < 127) {bank = 3;}
  choixprogchang();
  if (startcharg == 1) {readData(); firstcharg(); oldbank = bank;}
  if (bank != oldbank) {readData(); oldbank = bank;}
}

